tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/netc_hw/fsl_netc_hw_port.c
/*
 * Copyright 2021-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_netc_hw_port.h"

bool NETC_PortIsPseudo(NETC_PORT_Type *base)
{
    return ((base->PCAPR & NETC_PORT_PCAPR_LINK_TYPE_MASK) != 0U);
}

void NETC_PortSetMacAddr(NETC_PORT_Type *base, const uint8_t *macAddr)
{
    uint32_t address;

    /* Set physical address lower register. */
    address     = ((uint32_t *)(uintptr_t)macAddr)[0];
    base->PMAR0 = address;

    /* Set physical address high register. */
    address     = ((uint32_t)macAddr[5] << 8U) | (uint32_t)macAddr[4];
    base->PMAR1 = NETC_PORT_PMAR1_PRIM_MAC_ADDR(address);
}

status_t NETC_PortConfig(NETC_PORT_Type *base, const netc_port_common_t *config)
{
    status_t result;

    NETC_PortSetParser(base, &config->parser);
    NETC_PortSetVlanClassify(base, &config->acceptTpid);

    result = NETC_PortSetQosClassify(base, &config->qosMode);
    if (result != kStatus_Success)
    {
        return result;
    }

    (void)NETC_PortConfigTGS(base, &config->timeGate);
    NETC_PortSetIPF(base, &config->ipfCfg);
    NETC_PortSetMacAddr(base, &config->macAddr[0]);
    base->PCR = NETC_PORT_PCR_PSPEED(config->pSpeed) |
#if (defined(FSL_FEATURE_NETC_HAS_PORT_FCSEA) && FSL_FEATURE_NETC_HAS_PORT_FCSEA)
                NETC_PORT_PCR_FCSEA(!config->stompFcs) |
#endif
                NETC_PORT_PCR_TIMER_CS(config->rxTsSelect);
    base->PSGCR = NETC_PORT_PSGCR_OGC(config->ogcMode) | NETC_PORT_PSGCR_PDELAY(config->pDelay);

    /* Configure Port SDU overhead */
    base->PRXSDUOR =
        NETC_PORT_PRXSDUOR_MACSEC_BCO(config->rxMacsecBco) | NETC_PORT_PRXSDUOR_PPDU_BCO(config->rxPpduBco);
    base->PTXSDUOR =
        NETC_PORT_PTXSDUOR_MACSEC_BCO(config->txMacsecBco) | NETC_PORT_PTXSDUOR_PPDU_BCO(config->txPpduBco);
    return kStatus_Success;
}

status_t NETC_PortSetMII(NETC_ETH_LINK_Type *base,
                         netc_hw_mii_mode_t miiMode,
                         netc_hw_mii_speed_t speed,
                         netc_hw_mii_duplex_t duplex)
{
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_052167) && FSL_FEATURE_NETC_HAS_ERRATA_052167)
    /* ERR052167: Actual MAC Tx IPG is longer than configured when transmitting back-to-back packets in MII half duplex
    mode by approximately 15 extra bytes. For example, when configured for IPG=12, the actual IPG will be
    approximately 27. The net result is that maximum throughput will be reduced also in the absence of half-duplex
    collision/retry events. When using MII protocol, using full-duplex mode is recommended instead of half-duplex. If
    using MII half-duplex mode, additional bandwidth loss should be expected and accounted for due to extended IPG. */
#endif

    uint32_t reg = base->PM0_IF_MODE;

    /* Set MAC interface mode */
    reg &= ~NETC_ETH_LINK_PM0_IF_MODE_IFMODE_MASK;
    reg |= NETC_ETH_LINK_PM0_IF_MODE_IFMODE(miiMode);

    /* Set MAC speed and duplex */
    if ((miiMode == kNETC_MiiMode) || (miiMode == kNETC_RmiiMode))
    {
        if (speed == kNETC_MiiSpeed10M)
        {
            reg |= NETC_ETH_LINK_PM0_IF_MODE_M10_MASK;
        }
        else if (speed == kNETC_MiiSpeed100M)
        {
            reg &= ~NETC_ETH_LINK_PM0_IF_MODE_M10_MASK;
        }
        else
        {
            return kStatus_Fail;
        }
        reg &= ~NETC_ETH_LINK_PM0_IF_MODE_HD_MASK;
        reg |= NETC_ETH_LINK_PM0_IF_MODE_HD(duplex != kNETC_MiiFullDuplex);
    }
    else if (miiMode == kNETC_RgmiiMode)
    {
        reg &= ~NETC_ETH_LINK_PM0_IF_MODE_SSP_MASK;
        reg &= ~NETC_ETH_LINK_PM0_IF_MODE_HD_MASK;
        if (speed == kNETC_MiiSpeed1000M)
        {
            reg |= NETC_ETH_LINK_PM0_IF_MODE_SSP(speed);
            reg |= NETC_ETH_LINK_PM0_IF_MODE_HD(0);
        }
        else
        {
            reg |= NETC_ETH_LINK_PM0_IF_MODE_SSP(speed != kNETC_MiiSpeed100M);
            reg |= NETC_ETH_LINK_PM0_IF_MODE_HD(duplex != kNETC_MiiFullDuplex);
        }
    }
    else if (miiMode == kNETC_GmiiMode) /* kNETC_GmiiMode, force 1Gbps and full speed */
    {
        if ((speed < kNETC_MiiSpeed1000M) || (duplex != kNETC_MiiFullDuplex))
        {
            return kStatus_InvalidArgument;
        }
    }
    else
    {
        /* Avoid MISRA 2012 rule 15.7 */
    }
    base->PM0_IF_MODE = reg;
    base->PM1_IF_MODE = reg;

    return kStatus_Success;
}

status_t NETC_PortSetMaxFrameSize(NETC_ETH_LINK_Type *base, uint16_t size)
{
    /* The MAC supports reception of any frame size up to 2000 bytes. */
    if (size > NETC_PORT_MAX_FRAME_SIZE)
    {
        return kStatus_InvalidArgument;
    }

    base->PM0_MAXFRM = NETC_ETH_LINK_PM0_MAXFRM_MAXFRM(size);
    base->PM1_MAXFRM = NETC_ETH_LINK_PM1_MAXFRM_MAXFRM(size);

    return kStatus_Success;
}

status_t NETC_PortConfigEthMac(NETC_ETH_LINK_Type *base, const netc_port_ethmac_t *config)
{
    uint32_t reg = 0;
    status_t result;

    if ((config->rxMinFrameSize < NETC_PORT_MIN_FRAME_SIZE) || (config->rxMaxFrameSize > NETC_PORT_MAX_FRAME_SIZE) ||
        (config->rxMinFrameSize > config->rxMaxFrameSize))
    {
        return kStatus_InvalidArgument;
    }

    /* Set Rx Frame Maximum/Minimum Length */
    result = NETC_PortSetMaxFrameSize(base, config->rxMaxFrameSize);
    if (result != kStatus_Success)
    {
        return result;
    }
#if defined(NETC_ETH_LINK_PM0_MINFRM_NUM_BYTES_MASK)
    base->PM0_MINFRM = NETC_ETH_LINK_PM0_MINFRM_NUM_BYTES(config->rxMinFrameSize);
#endif
#if defined(NETC_ETH_LINK_PM1_MINFRM_NUM_BYTES_MASK)
    base->PM1_MINFRM = NETC_ETH_LINK_PM1_MINFRM_NUM_BYTES(config->rxMinFrameSize);
#endif

    /* Set MAC interface mode, speed and duplex */
    result = NETC_PortSetMII(base, config->miiMode, config->miiSpeed, config->miiDuplex);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Enable reverse mode */
    reg = base->PM0_IF_MODE;
    if (config->enableRevMii)
    {
        reg |= NETC_ETH_LINK_PM0_IF_MODE_REVMII_MASK;
    }
    else
    {
        reg &= ~NETC_ETH_LINK_PM0_IF_MODE_REVMII_MASK;
    }
    /* Enable RGMII Tx clock stop status during low power idle.  */
    if (config->rgmiiClkStop)
    {
        reg |= NETC_ETH_LINK_PM0_IF_MODE_CLK_STOP_MASK;
    }
    else
    {
        reg &= ~NETC_ETH_LINK_PM0_IF_MODE_CLK_STOP_MASK;
    }
    base->PM0_IF_MODE = reg;
    base->PM1_IF_MODE = reg;

