tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/netc_hw/fsl_netc_hw_port.c
    NETC_PortConfigEthMacPreemption(base, &config->PreemptionConfig);

#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051255) && FSL_FEATURE_NETC_HAS_ERRATA_051255)
    reg = NETC_ETH_LINK_PM0_SINGLE_STEP_CH(config->enChUpdate) |
          NETC_ETH_LINK_PM0_SINGLE_STEP_OFFSET(config->oneStepOffset) |
          NETC_ETH_LINK_PM0_SINGLE_STEP_EN(config->enOneStepTS);
    base->PM0_SINGLE_STEP = reg;
    base->PM1_SINGLE_STEP = reg;
#endif

    /* Enable Tx/Rx */
    reg = NETC_ETH_LINK_PM0_COMMAND_CONFIG_TX_EN_MASK | NETC_ETH_LINK_PM0_COMMAND_CONFIG_RX_EN_MASK |
          NETC_ETH_LINK_PM0_COMMAND_CONFIG_TS_MODE(config->txTsSelect) |
          NETC_ETH_LINK_PM0_COMMAND_CONFIG_TS_PNT(config->isTsPointPhy) |
#if defined(NETC_ETH_LINK_PM0_COMMAND_CONFIG_HD_FCEN_MASK)
          NETC_ETH_LINK_PM0_COMMAND_CONFIG_HD_FCEN(config->enableHalfDuplexFlowCtrl) |
#endif
          NETC_ETH_LINK_PM0_COMMAND_CONFIG_TXP(config->enTxPad);
    base->PM0_COMMAND_CONFIG = reg;
    base->PM1_COMMAND_CONFIG = reg;

    if (config->enableHalfDuplexFlowCtrl)
    {
        assert((config->maxBackPressOn <= 3036U) && (config->minBackPressOff <= 20U));
        reg = NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_ON_MAX(config->maxBackPressOn) |
              NETC_ETH_LINK_PM0_HD_FLOW_CTRL_HD_BP_OFF_MIN(config->minBackPressOff);
        base->PM0_HD_FLOW_CTRL = reg;
        base->PM1_HD_FLOW_CTRL = reg;
    }

#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051994) && FSL_FEATURE_NETC_HAS_ERRATA_051994
    /* ERRATA051994: The NETC does not always obey the wakeup time in PMn_LPWAKETIMER. and as a result may transmit
       frames before the PHY has woken up from low power state. Such frames would be lost. Disable autonomous low power
       idle on Tx in case this issue. Note: Latest RT1180 Errata doc removed this Errata number as it's de-featured
       in the latest silicon revision C0. However, driver still needs to use this macro to avoid using related registers. */
    if (config->txSleepTimeCycleEEE != 0U)
    {
        return kStatus_NETC_Unsupported;
    }
#else
    assert((config->txSleepTimeCycleEEE <= 0xFFFFFFU) && (config->txWakeupTimeCycleEEE <= 0xFFFFFFU));

    base->PM0_SLEEP_TIMER = config->txSleepTimeCycleEEE;
    base->PM1_SLEEP_TIMER = config->txSleepTimeCycleEEE;

    if (config->txSleepTimeCycleEEE != 0U)
    {
        base->PM0_LPWAKE_TIMER = config->txWakeupTimeCycleEEE;
        base->PM0_LPWAKE_TIMER = config->txWakeupTimeCycleEEE;
    }
#endif

    return kStatus_Success;
}

uint32_t NETC_GetPortMacInterruptFlags(NETC_ETH_LINK_Type *base, netc_port_phy_mac_type_t macType)
{
    if (macType == kNETC_ExpressMAC)
    {
        return base->PM0_IEVENT;
    }
    else
    {
        return base->PM1_IEVENT;
    }
}

void NETC_ClearPortMacInterruptFlags(NETC_ETH_LINK_Type *base, netc_port_phy_mac_type_t macType, uint32_t mask)
{
    if (macType == kNETC_ExpressMAC)
    {
        base->PM0_IEVENT |= mask;
    }
    else
    {
        base->PM1_IEVENT |= mask;
    }
}

void NETC_EnablePortMacInterrupts(NETC_ETH_LINK_Type *base,
                                  netc_port_phy_mac_type_t macType,
                                  uint32_t mask,
                                  bool enable)
{
    if (macType == kNETC_ExpressMAC)
    {
        if (enable)
        {
            base->PM0_IMASK |= mask;
        }
        else
        {
            base->PM0_IMASK &= ~mask;
        }
    }
    else
    {
        if (enable)
        {
            base->PM1_IMASK |= mask;
        }
        else
        {
            base->PM1_IMASK &= ~mask;
        }
    }
}

status_t NETC_PortEnableLoopback(NETC_ETH_LINK_Type *base, netc_port_loopback_mode_t loopMode, bool enable)
{
    uint32_t reg = base->PM0_COMMAND_CONFIG;

    if (enable)
    {
        reg &= ~NETC_ETH_LINK_PM0_COMMAND_CONFIG_LPBK_MODE_MASK;
        reg |= NETC_ETH_LINK_PM0_COMMAND_CONFIG_LOOP_ENA_MASK | NETC_ETH_LINK_PM0_COMMAND_CONFIG_LPBK_MODE(loopMode);
    }
    else
    {
        reg &= ~NETC_ETH_LINK_PM0_COMMAND_CONFIG_LOOP_ENA_MASK;
    }

    base->PM0_COMMAND_CONFIG = reg;
    base->PM1_COMMAND_CONFIG = reg;

    return kStatus_Success;
}

void NETC_PortGetDiscardStatistic(NETC_PORT_Type *base,
                                  netc_port_discard_tpye_t discardType,
                                  netc_port_discard_statistic_t *statistic)
{
    switch (discardType)
    {
        case kNETC_RxDiscard:
            statistic->count   = base->PRXDCR;
            statistic->reason0 = base->PRXDCRR0;
            statistic->reason1 = base->PRXDCRR1;
            break;
#if !(defined(FSL_FEATURE_NETC_HAS_NO_SWITCH) && FSL_FEATURE_NETC_HAS_NO_SWITCH)
        case kNETC_TxDiscard:
            statistic->count   = base->PTXDCR;
            statistic->reason0 = base->PTXDCRR0;
            statistic->reason1 = base->PTXDCRR1;
            break;
        case kNETC_BridgeDiscard:
            statistic->count   = base->BPDCR;
            statistic->reason0 = base->BPDCRR0;
            statistic->reason1 = base->BPDCRR1;
            break;
#endif
        default:
            assert(false);
            break;
    }
}

void NETC_PortClearDiscardReason(NETC_PORT_Type *base,
                                 netc_port_discard_tpye_t discardType,
                                 uint32_t reason0,
                                 uint32_t reason1)
{
    switch (discardType)
    {
        case kNETC_RxDiscard:
            base->PRXDCRR0 = reason0;
            base->PRXDCRR1 = reason1;
            break;
#if !(defined(FSL_FEATURE_NETC_HAS_NO_SWITCH) && FSL_FEATURE_NETC_HAS_NO_SWITCH)
        case kNETC_TxDiscard:
            base->PTXDCRR0 = reason0;
            base->PTXDCRR1 = reason1;
            break;
        case kNETC_BridgeDiscard:
            base->BPDCRR0 = reason0;
            base->BPDCRR1 = reason1;
            break;
#endif
        default:
            assert(false);
            break;
    }
}

void NETC_PortGetPhyMacTxStatistic(NETC_ETH_LINK_Type *base,
                                   netc_port_phy_mac_type_t macType,
                                   netc_port_phy_mac_traffic_statistic_t *statistic)
{
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_050679) && FSL_FEATURE_NETC_HAS_ERRATA_050679)
    uint32_t primask;

    primask = DisableGlobalIRQ();
#endif
    statistic->rxMinPacket = 0;
    if (macType == kNETC_ExpressMAC)
    {
#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051711) && FSL_FEATURE_NETC_HAS_ERRATA_051711
        /* ERRATA051711: MAC statistic counters TEOCT and TOCT are inaccurate after Pause frames are transmitted with
           flexible preamble enabled (PM0_TX_IPG_PREAMBLE[FLEX_PREAMBLE_EN] = 1) and flexible preamble count
           (PM0_TX_IPG_PREAMBLE[FLEX_PREAMBLE_CNT]) set to less than 7. */
        uint32_t flexPreambleCnt =
            (base->PM0_TX_IPG_PREAMBLE & NETC_ETH_LINK_PM0_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_MASK) >>
            NETC_ETH_LINK_PM0_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT_SHIFT;
        if ((base->PM0_TX_IPG_PREAMBLE & NETC_ETH_LINK_PM0_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_MASK) != 0U)
        {
            statistic->totalOctet = base->PM0_TEOCTN - base->PM0_TXPFN * ((uint64_t)7U - flexPreambleCnt);
            statistic->validOctet = base->PM0_TOCTN - base->PM0_TXPFN * ((uint64_t)7U - flexPreambleCnt);
        }
        else
        {
            statistic->totalOctet = base->PM0_TEOCTN;
            statistic->validOctet = base->PM0_TOCTN;
        }
#else
        statistic->totalOctet = base->PM0_TEOCTN;
        statistic->validOctet = base->PM0_TOCTN;
#endif
        statistic->pauseFrame = base->PM0_TXPFN;
#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051710) && FSL_FEATURE_NETC_HAS_ERRATA_051710
        /* ERRATA051710: After one or more late collision or excessive collision events, counters PMa_TOCTn and
           PMa_TFRMn will be higher than expected. The accurate value cannot be recovered for PMa_TOCTn, but PMa_TRFMn
           can be recovered as follows formula. */
        statistic->validFrame = base->PM0_TFRMN - base->PM0_TLCOLN - base->PM0_TECOLN;
#else
        statistic->validFrame = base->PM0_TFRMN;
#endif
        statistic->vlanFrame              = base->PM0_TVLANN;
        statistic->unicastFrame           = base->PM0_TUCAN;
        statistic->multicastFrame         = base->PM0_TMCAN;
        statistic->boradcastFrame         = base->PM0_TBCAN;
        statistic->totalPacket            = base->PM0_TPKTN;
        statistic->total64BPacket         = base->PM0_T64N;
        statistic->total65To127BPacket    = base->PM0_T127N;
        statistic->total128To255BPacket   = base->PM0_T255N;
        statistic->total256To511BPacket   = base->PM0_T511N;
        statistic->total511To1023BPacket  = base->PM0_T1023N;
        statistic->total1024To1522BPacket = base->PM0_T1522N;
        statistic->total1523ToMaxBPacket  = base->PM0_T1523XN;
        statistic->controlPacket          = base->PM0_TCNPN;
    }
    else if (macType == kNETC_PreemptableMAC)
    {
        statistic->totalOctet = base->PM1_TEOCTN;
        statistic->validOctet = base->PM1_TOCTN;
        statistic->pauseFrame = base->PM1_TXPFN;
#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051710) && FSL_FEATURE_NETC_HAS_ERRATA_051710
        /* ERRATA051710: After one or more late collision or excessive collision events, counters PMa_TOCTn and
           PMa_TFRMn will be higher than expected. The accurate value cannot be recovered for PMa_TOCTn, but PMa_TRFMn
           can be recovered as follows formula. */
        statistic->validFrame = base->PM1_TFRMN - base->PM1_TLCOLN - base->PM1_TECOLN;
#else
        statistic->validFrame = base->PM1_TFRMN;
#endif
        statistic->vlanFrame              = base->PM1_TVLANN;
        statistic->unicastFrame           = base->PM1_TUCAN;
        statistic->multicastFrame         = base->PM1_TMCAN;
        statistic->boradcastFrame         = base->PM1_TBCAN;
        statistic->totalPacket            = base->PM1_TPKTN;
        statistic->total64BPacket         = base->PM1_T64N;
        statistic->total65To127BPacket    = base->PM1_T127N;
        statistic->total128To255BPacket   = base->PM1_T255N;
        statistic->total256To511BPacket   = base->PM1_T511N;
        statistic->total511To1023BPacket  = base->PM1_T1023N;
        statistic->total1024To1522BPacket = base->PM1_T1522N;
        statistic->total1523ToMaxBPacket  = base->PM1_T1523XN;
        statistic->controlPacket          = base->PM1_TCNPN;
    }
    else
    {
        ; /* Intentional empty */
    }

#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_050679) && FSL_FEATURE_NETC_HAS_ERRATA_050679)
    EnableGlobalIRQ(primask);
#endif
}

void NETC_PortGetPhyMacRxStatistic(NETC_ETH_LINK_Type *base,
                                   netc_port_phy_mac_type_t macType,
                                   netc_port_phy_mac_traffic_statistic_t *statistic)
{
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_050679) && FSL_FEATURE_NETC_HAS_ERRATA_050679)
    uint32_t primask;

    primask = DisableGlobalIRQ();
#endif

    if (macType == kNETC_ExpressMAC)
    {
        statistic->totalOctet             = base->PM0_REOCTN;
        statistic->validOctet             = base->PM0_ROCTN;
        statistic->pauseFrame             = base->PM0_RXPFN;
        statistic->validFrame             = base->PM0_RFRMN;
        statistic->vlanFrame              = base->PM0_RVLANN;
        statistic->unicastFrame           = base->PM0_RUCAN;
        statistic->multicastFrame         = base->PM0_RMCAN;
        statistic->boradcastFrame         = base->PM0_RBCAN;
        statistic->totalPacket            = base->PM0_RPKTN;
        statistic->total64BPacket         = base->PM0_R64N;
        statistic->total65To127BPacket    = base->PM0_R127N;
        statistic->total128To255BPacket   = base->PM0_R255N;
        statistic->total256To511BPacket   = base->PM0_R511N;
        statistic->total511To1023BPacket  = base->PM0_R1023N;
        statistic->total1024To1522BPacket = base->PM0_R1522N;
        statistic->total1523ToMaxBPacket  = base->PM0_R1523XN;
        statistic->controlPacket          = base->PM0_RCNPN;
#if defined(NETC_ETH_LINK_PM0_RMIN63N_RMIN63n_MASK)
        statistic->rxMinPacket = base->PM0_RMIN63N;
#endif
    }
    else if (macType == kNETC_PreemptableMAC)
    {
        statistic->totalOctet             = base->PM1_REOCTN;
        statistic->validOctet             = base->PM1_ROCTN;
        statistic->pauseFrame             = base->PM1_RXPFN;
        statistic->validFrame             = base->PM1_RFRMN;
        statistic->vlanFrame              = base->PM1_RVLANN;
        statistic->unicastFrame           = base->PM1_RUCAN;
        statistic->multicastFrame         = base->PM1_RMCAN;
        statistic->boradcastFrame         = base->PM1_RBCAN;
        statistic->totalPacket            = base->PM1_RPKTN;
        statistic->total64BPacket         = base->PM1_R64N;
        statistic->total65To127BPacket    = base->PM1_R127N;
        statistic->total128To255BPacket   = base->PM1_R255N;
        statistic->total256To511BPacket   = base->PM1_R511N;
        statistic->total511To1023BPacket  = base->PM1_R1023N;
        statistic->total1024To1522BPacket = base->PM1_R1522N;
        statistic->total1523ToMaxBPacket  = base->PM1_R1523XN;
        statistic->controlPacket          = base->PM1_RCNPN;
#if defined(NETC_ETH_LINK_PM1_RMIN63N_RMIN63n_MASK)
        statistic->rxMinPacket = base->PM1_RMIN63N;
#endif
    }
    else
    {
        ; /* Intentional empty */
    }

#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_050679) && FSL_FEATURE_NETC_HAS_ERRATA_050679)
    EnableGlobalIRQ(primask);
#endif
}

