tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/netc_hw/fsl_netc_hw_port.c
void NETC_PortGetPhyMacDiscardStatistic(NETC_ETH_LINK_Type *base,
                                        netc_port_phy_mac_type_t macType,
                                        netc_port_phy_mac_discard_statistic_t *statistic)
{
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_050679) && FSL_FEATURE_NETC_HAS_ERRATA_050679)
    uint32_t primask;

    primask = DisableGlobalIRQ();
#endif
    if (macType == kNETC_ExpressMAC)
    {
        statistic->rxError              = base->PM0_RERRN;
        statistic->rxUndersized         = base->PM0_RUNDN;
        statistic->rxOversized          = base->PM0_ROVRN;
        statistic->rxErrorFCS           = base->PM0_RFCSN;
        statistic->rxFragment           = base->PM0_RFRGN;
        statistic->rxJabber             = base->PM0_RJBRN;
        statistic->rxDiscard            = base->PM0_RDRPN;
        statistic->rxDiscardNoTruncated = base->PM0_RDRNTPN;
        statistic->txErrorFCS           = base->PM0_TERRN;
        statistic->txUndersized         = base->PM0_TUNDN;
    }
    else if (macType == kNETC_PreemptableMAC)
    {
        statistic->rxError              = base->PM1_RERRN;
        statistic->rxUndersized         = base->PM1_RUNDN;
        statistic->rxOversized          = base->PM1_ROVRN;
        statistic->rxErrorFCS           = base->PM1_RFCSN;
        statistic->rxFragment           = base->PM1_RFRGN;
        statistic->rxJabber             = base->PM1_RJBRN;
        statistic->rxDiscard            = base->PM1_RDRPN;
        statistic->rxDiscardNoTruncated = base->PM1_RDRNTPN;
        statistic->txErrorFCS           = base->PM1_TERRN;
        statistic->txUndersized         = base->PM1_TUNDN;
    }
    else
    {
        ; /* Intentional empty */
    }
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_050679) && FSL_FEATURE_NETC_HAS_ERRATA_050679)
    EnableGlobalIRQ(primask);
#endif
}

void NETC_PortGetPhyMacPreemptionStatistic(NETC_ETH_LINK_Type *base,
                                           netc_port_phy_mac_preemption_statistic_t *statistic)
{
    statistic->rxReassembledFrame = base->MAC_MERGE_MMFAOCR;
#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051707) && FSL_FEATURE_NETC_HAS_ERRATA_051707
    /* ERRATA051707: The host that is reading MAC_MERGE_MMFAECR register should check status of PM1_RFCS. If the
       PM1_RFCS indicates no error then MAC_MERGE_MMFAECR is valid and can be used if on other hand there is an error
       reported in PM1_RFCS register then MAC_MERGE_MMFAECR might be incorrect and should be treated accordingly. */
    statistic->rxReassembledError = (base->PM1_RFCSN == 0U) ? base->MAC_MERGE_MMFAECR : 0U;
#else
    statistic->rxReassembledError = base->MAC_MERGE_MMFAECR;
#endif
    statistic->rxMPacket       = base->MAC_MERGE_MMFCRXR;
    statistic->rxSMDError      = base->MAC_MERGE_MMFSECR;
    statistic->txPreemptionReq = base->MAC_MERGE_MMHCR;
    statistic->txMPacket       = base->MAC_MERGE_MMFCTXR;
}

#if !(defined(FSL_FEATURE_NETC_HAS_NO_SWITCH) && FSL_FEATURE_NETC_HAS_NO_SWITCH)
void NETC_PortGetPseudoMacTrafficStatistic(NETC_PSEUDO_LINK_Type *base,
                                           bool getTx,
                                           netc_port_pseudo_mac_traffic_statistic_t *statistic)
{
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_050679) && FSL_FEATURE_NETC_HAS_ERRATA_050679)
    uint32_t primask;

    primask = DisableGlobalIRQ();
#endif
    if (getTx)
    {
        statistic->totalOctet     = ((uint64_t)base->PPMTOCR[1] << 32U) | base->PPMTOCR[0];
        statistic->unicastFrame   = ((uint64_t)base->PPMTUFCR[1] << 32U) | base->PPMTUFCR[0];
        statistic->multicastFrame = ((uint64_t)base->PPMTMFCR[1] << 32U) | base->PPMTMFCR[0];
        statistic->boradcastFrame = ((uint64_t)base->PPMTBFCR[1] << 32U) | base->PPMTBFCR[0];
    }
    else
    {
        statistic->totalOctet     = ((uint64_t)base->PPMROCR[1] << 32U) | base->PPMROCR[0];
        statistic->unicastFrame   = ((uint64_t)base->PPMRUFCR[1] << 32U) | base->PPMRUFCR[0];
        statistic->multicastFrame = ((uint64_t)base->PPMRMFCR[1] << 32U) | base->PPMRMFCR[0];
        statistic->boradcastFrame = ((uint64_t)base->PPMRBFCR[1] << 32U) | base->PPMRBFCR[0];
    }
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_050679) && FSL_FEATURE_NETC_HAS_ERRATA_050679)
    EnableGlobalIRQ(primask);
#endif
}
#endif

status_t NETC_PortConfigTxIpgPreamble(NETC_ETH_LINK_Type *base, uint8_t preambleCnt, uint8_t ipgLen)
{
    assert((preambleCnt >= 1U) && (preambleCnt <= 7U));
    assert((ipgLen >= 4U) && (ipgLen <= 24U));
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_052129) && FSL_FEATURE_NETC_HAS_ERRATA_052129)
    /* ERR052129: The receiving NETC MAC cannot reliably detect the frame when IPG length and flexiable preamble are set
       to the minimum value. As a result, frames may be lost, or partially received with a CRC error (e.g. if there is a
       data octet later in the frame that matches SFD). When connecting NETC MAC to NETC MAC, for IPG_LEN=4, the minimum
       supported preamble is 2 bytes. When connecting NETC MAC to another device that supports shorter-than standard IPG
       and preamble, ensure that the minimum IPG + preamble is 6 octets. */
    assert((ipgLen + preambleCnt) >= 6U);
#endif

#if defined(NETC_ETH_LINK_PM0_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_MASK) && \
    defined(NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN_MASK)
    bool enable = (preambleCnt < 7U) ? true : false;

    base->PM0_TX_IPG_PREAMBLE = NETC_ETH_LINK_PM0_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN(enable) |
                                NETC_ETH_LINK_PM0_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT(preambleCnt) |
                                NETC_ETH_LINK_PM0_TX_IPG_PREAMBLE_IPG_LEN(ipgLen);
    base->PM1_TX_IPG_PREAMBLE = NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_EN(enable) |
                                NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_FLEX_PREAMBLE_CNT(preambleCnt) |
                                NETC_ETH_LINK_PM1_TX_IPG_PREAMBLE_IPG_LEN(ipgLen);
#endif
    return kStatus_Success;
}

